<span style="text-align: center;color:Red;font-size: 20px;text-align: center;font-weight:bold ; font-size:40px">Perform Data Cleaning</span><br>
<span style="text-align: center;color:Red;font-size: 20px;text-align: center;font-weight:bold ; font-size:30px">Clean a dataset by removing missing values and outliers.</span>

In [170]:
import pandas as pd

In [171]:
tt=pd.read_csv(r"D:\Future Intern\titanic\train.csv")

In [172]:
tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [173]:
tt.shape

(891, 12)


<span style="text-align: center;color:Blue;font-size: 20px;text-align: center;font-weight:bold ; font-size:30px">Step 1 - Data Cleaning</span>

In [174]:
tt.isnull().sum()[tt.isnull().sum()>0]

Age         177
Cabin       687
Embarked      2
dtype: int64

In [175]:
tt.Embarked.mode()

0    S
Name: Embarked, dtype: object

In [176]:
# Filling missing values in 'Age' with the median age
tt['Age'] = tt['Age'].fillna(tt['Age'].median())

In [177]:
# Filling missing values in 'Fare' with the mean fare
tt['Fare'] = tt['Fare'].fillna(tt['Fare'].mean())

In [178]:
# Filling missing values in 'Embarked' with the mode of the Embarked column
tt['Embarked'] = tt['Embarked'].fillna(tt['Embarked'].mode()[0])

In [179]:
# The 'Cabin' column still has too many missing values, so we will drop it
tt_cleaned = tt.drop(columns=['Cabin'])
# As passenger id has unique passenger info so should drop it
tt_cleaned = tt.drop(columns=['PassengerId'])

In [180]:
tt_cleaned

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [181]:
 tt_cleaned.isnull().sum()[ tt_cleaned.isnull().sum()>0]

Cabin    687
dtype: int64

In [182]:
print("Task 1 - Step 1: Data Cleaning Completed")
print("Missing values filled for Age, Fare, and Embarked")
print("Cabin column was dropped as it has many null values")
print("Final shape of the dataset:", tt_cleaned.shape)

Task 1 - Step 1: Data Cleaning Completed
Missing values filled for Age, Fare, and Embarked
Cabin column was dropped as it has many null values
Final shape of the dataset: (891, 11)


<span style="text-align: center;color:Blue;font-size: 20px;text-align: center;font-weight:bold ; font-size:30px">Step 2  - Removing Outliers</span>

In [183]:
def remove_outliers(df):
    total_outliers_removed = 0
    numeric_columns = df.select_dtypes(include=['float64', 'int64']).columns
    
    for column in numeric_columns:
       
        Q1 = df[column].quantile(0.25)
        Q3 = df[column].quantile(0.75)
        IQR = Q3 - Q1
        
        
        lower = Q1 - 1.5 * IQR
        upper = Q3 + 1.5 * IQR
        
        # rows in original dataframe
        original_count = len(df)
        
        # Remove outliers
        df = df[(df[column] >= lower) & (df[column] <= upper)]
        
        # Calculate how many rows were removed
        outliers_removed = original_count - len(df)
        total_outliers_removed += outliers_removed
        
        # Print the number of outliers removed from this column
        print("Outliers removed from:",column,"--->", outliers_removed)
    
    # Returning the cleaned dataframe and the total number of outliers removed
    return df, total_outliers_removed

# Removing outliers from all numeric columns
tt_cleaned, total_outliers_removed = remove_outliers(tt_cleaned)

Outliers removed from: Survived ---> 0
Outliers removed from: Pclass ---> 0
Outliers removed from: Age ---> 66
Outliers removed from: SibSp ---> 39
Outliers removed from: Parch ---> 144
Outliers removed from: Fare ---> 81

<span style="text-align: center;color:Red;font-size: 20px;text-align: center;font-weight:bold ; font-size:30px">Conclusion for Task 1</span>

In [184]:
print("Task 1: Data Cleaning Completed")
print("Missing values filled for Age, Fare, and Embarked")
print("Cabin column was dropped as it has many null values")
print("Total outliers removed from the dataset:", total_outliers_removed)
print("Final shape of the dataset:", tt_cleaned.shape)

Task 1: Data Cleaning Completed
Missing values filled for Age, Fare, and Embarked
Cabin column was dropped as it has many null values
Total outliers removed from the dataset: 330
Final shape of the dataset: (561, 11)